airfoilSDBD_rans/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          402852;
        startFace       805725;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          402852;
        startFace       1208577;
    }
    inlet
    {
        type            patch;
        nFaces          630;
        startFace       1611429;
    }
    outlet
    {
        type            patch;
        nFaces          602;
        startFace       1612059;
    }
    airfoil
    {
        type            wall;
        inGroups        1(wall);
        nFaces          791;
        startFace       1612661;
    }
)

// ************************************************************************* //
